actuator/fluid_case_test/CASE_DBD_AC/Fluid_case/0/Air/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    UpWall
    {
        type            zeroGradient;
    }
    LeftWall
    {
        type            zeroGradient;
    }
    RightWall
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
    anode
    {
        type            noSlip;
    }
    Air_to_Dielectric
    {
        type            noSlip;
    }
}

// ************************************************************************* //
