actuator/fluid_case_test/CASE_DBD_AC/Fluid_case/0/Air/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/Air";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 101300;

boundaryField
{
    UpWall
    {
        type            zeroGradient;
    }
    LeftWall
    {
        type            zeroGradient;
    }
    RightWall
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
    anode
    {
        type            zeroGradient;
    }
    Air_to_Dielectric
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
