actuator/fluid_case_test/CASE_DBD_AC/Fluid_case/Allrun-parallel
#b#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

./Allmesh

COUNTER = 0
#########################################
#for index in 1e-06 2e-06 3e-06 4e-06 5e-06 6e-06 7e-06 8e-06 9e-06 1e-05 1.1e-05 1.2e-05 1.3e-05 1.4e-05 1.5e-05 1.6e-05 1.7e-05 1.8e-05 1.9e-05 2e-05 2.1e-05 2.2e-05 2.3e-05 2.4e-05 2.5e-05 2.6e-05 2.7e-05 2.8e-05 2.9e-05 3e-05 3.1e-05 3.2e-05 3.3e-05 3.4e-05 3.5e-05 3.6e-05 3.7e-05 3.8e-05 3.9e-05 4e-05 4.1e-05 4.2e-05 4.3e-05 4.4e-05 4.5e-05 4.6e-05 4.7e-05 4.8e-05 4.9e-05 5e-05 5.1e-05 5.2e-05 5.3e-05 5.4e-05 5.5e-05 5.6e-05 5.7e-05 5.8e-05 5.9e-05 6e-05 6.1e-05 6.2e-05 6.3e-05 6.4e-05 6.5e-05 6.6e-05 6.7e-05 6.8e-05 6.9e-05 7e-05 7.1e-05 7.2e-05 7.3e-05 7.4e-05 7.5e-05 7.6e-05 7.7e-05 7.8e-05 7.9e-05 8e-05 8.1e-05 8.2e-05 8.3e-05 8.4e-05 8.5e-05 8.6e-05 8.7e-05 8.8e-05 8.9e-05 9e-05 9.1e-05 9.2e-05 9.3e-05 9.4e-05 9.5e-05 9.6e-05 9.7e-05 9.8e-05 9.9e-05 ;
#for index in 0 1e-05 2e-05 3e-05 4e-05 5e-05 6e-05 7e-05 8e-05 9e-05 ; #f=10kHz 10 times
for index in 0 2e-05 4e-05 6e-05 8e-05 0.0001 0.00012 0.00014 0.00016 0.00018 ; #f=5kHz 10 times
do 

	mapFields ../Electrostatic_case_discharge/ -sourceRegion Air -sourceTime $index -targetRegion Air 
    let COUNTER++
	mv 0/Air/f_el  constant/Air/f_el_$COUNTER
    cp -r constant/Air/f_el 0/Air/

done

###############################
	
runApplication -s Air decomposePar -region Air -constant

mpirun -np 16 fluid_DBD_compressibleV2_dischargeV2 -parallel

runApplication -s Air    reconstructPar -region Air

#------------------------------------------------------------------------------
